Merge pull request #22 from vpoluyaktov/feature/spec-cleanup-high-level-docs
docs: simplify specification for high-level project state
